package nc.lab.lab3;


public class Main {
    /**
     * 1. Многопоточное пепемножение матриц
     * 2. Многопоточная сортировка Шелла
     * 3. Система многопоточного обслуживания:
     * • касса(сумма)
     * • операционистки(выполняют операции, имеют очередь)
     * • клиент(сумма денег, положить/снять, время обслуживания)
     * • основной поток случайно генерит клиенты
     * • клиент становится к операционистке с меньшей очереди
     * • обслуживание: a) обслужить б) уснуть на время обслуживания
     * • если в кассе денег нет, выдавать нельзя
     * • выводить логи
     */
    public static void main(String[] args) {

    }
}
